# Compound Structure Get Deck Embedding Type Method

Source: https://www.revitapidocs.com/2026/bb52f22b-39b0-72ae-cb2f-4504eac02e9d.htm

---

| Compound Structure Get Deck Embedding Type Method |
| --- |

Retrieves the deck embedding type used for the specified structural deck.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public StructDeckEmbeddingType GetDeckEmbeddingType(
	int layerIdx
)
```

```
Public Function GetDeckEmbeddingType (
	layerIdx As Integer
) As StructDeckEmbeddingType
```

```
public:
StructDeckEmbeddingType GetDeckEmbeddingType(
	int layerIdx
)
```

```
member GetDeckEmbeddingType :
        layerIdx : int -> StructDeckEmbeddingType
```

#### Parameters

layerIdx Int32
:   Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.

#### Return Value

StructDeckEmbeddingType
The embedding type of the structural deck associated to the specified layer. Invalid if it is not a structural deck. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The layer index is out of range. |

See Also

#### Reference

CompoundStructure Class Autodesk.Revit.DB Namespace